node {
  name: "Placeholder"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: -1
        }
        dim {
          size: -1
        }
        dim {
          size: 3
        }
      }
    }
  }
}
node {
  name: "img_mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 1
          }
          dim {
            size: 1
          }
          dim {
            size: 1
          }
          dim {
            size: 3
          }
        }
        tensor_content: ")\\\367B\331\216\351B\305\340\317B"
      }
    }
  }
}
node {
  name: "sub"
  op: "Sub"
  input: "Placeholder"
  input: "img_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MobilenetV2/input"
  op: "Identity"
  input: "sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MobilenetV2/Conv/weights/Initializer/truncated_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobilenetV2/Conv/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000\003\000\000\000\020\000\000\000"
      }
    }
  }
}
node {
  name: "MobilenetV2/Conv/weights/Initializer/truncated_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobilenetV2/Conv/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "MobilenetV2/Conv/weights/Initializer/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobilenetV2/Conv/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.09000000357627869
      }
    }
  }
}
node {
  name: "MobilenetV2/Conv/weights/Initializer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "MobilenetV2/Conv/weights/Initializer/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobilenetV2/Conv/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "MobilenetV2/Conv/weights/Initializer/truncated_normal/mul"
  op: "Mul"
  input: "MobilenetV2/Conv/weights/Initializer/truncated_normal/TruncatedNormal"
  input: "MobilenetV2/Conv/weights/Initializer/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobilenetV2/Conv/weights"
      }
    }
  }
}
node {
  name: "MobilenetV2/Conv/weights/Initializer/truncated_normal"
  op: "AddV2"
  input: "MobilenetV2/Conv/weights/Initializer/truncated_normal/mul"
  input: "MobilenetV2/Conv/weights/Initializer/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobilenetV2/Conv/weights"
      }
    }
  }
}
node {
  name: "MobilenetV2/Conv/weights"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobilenetV2/Conv/weights"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "MobilenetV2/Conv/weights"
    }
  }
}
node {
  name: "MobilenetV2/Conv/weights/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "MobilenetV2/Conv/weights"
}
node {
  name: "MobilenetV2/Conv/weights/Assign"
  op: "AssignVariableOp"
  input: "MobilenetV2/Conv/weights"
  input: "MobilenetV2/Conv/weights/Initializer/truncated_normal"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: false
    }
  }
}
node {
  name: "MobilenetV2/Conv/weights/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "MobilenetV2/Conv/weights"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MobilenetV2/Conv/kernel/Regularizer/Square/ReadVariableOp"
  op: "ReadVariableOp"
  input: "MobilenetV2/Conv/weights"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MobilenetV2/Conv/kernel/Regularizer/Square"
  op: "Square"
  input: "MobilenetV2/Conv/kernel/Regularizer/Square/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MobilenetV2/Conv/kernel/Regularizer/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\000\000\000\000\001\000\000\000\002\000\000\000\003\000\000\000"
      }
    }
  }
}
node {
  name: "MobilenetV2/Conv/kernel/Regularizer/Sum"
  op: "Sum"
  input: "MobilenetV2/Conv/kernel/Regularizer/Square"
  input: "MobilenetV2/Conv/kernel/Regularizer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "MobilenetV2/Conv/kernel/Regularizer/mul/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.9999999494757503e-05
      }
    }
  }
}
node {
  name: "MobilenetV2/Conv/kernel/Regularizer/mul"
  op: "Mul"
  input: "MobilenetV2/Conv/kernel/Regularizer/mul/x"
  input: "MobilenetV2/Conv/kernel/Regularizer/Sum"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MobilenetV2/Conv/Conv2D/ReadVariableOp"
  op: "ReadVariableOp"
  input: "MobilenetV2/Conv/weights"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MobilenetV2/Conv/Conv2D"
  op: "Conv2D"
  input: "MobilenetV2/input"
  input: "MobilenetV2/Conv/Conv2D/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "MobilenetV2/Conv/BatchNorm/gamma/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobilenetV2/Conv/BatchNorm/gamma"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "MobilenetV2/Conv/BatchNorm/gamma"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobilenetV2/Conv/BatchNorm/gamma"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "MobilenetV2/Conv/BatchNorm/gamma"
    }
  }
}
node {
  name: "MobilenetV2/Conv/BatchNorm/gamma/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "MobilenetV2/Conv/BatchNorm/gamma"
}
node {
  name: "MobilenetV2/Conv/BatchNorm/gamma/Assign"
  op: "AssignVariableOp"
  input: "MobilenetV2/Conv/BatchNorm/gamma"
  input: "MobilenetV2/Conv/BatchNorm/gamma/Initializer/ones"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: false
    }
  }
}
node {
  name: "MobilenetV2/Conv/BatchNorm/gamma/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "MobilenetV2/Conv/BatchNorm/gamma"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MobilenetV2/Conv/BatchNorm/beta/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobilenetV2/Conv/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "MobilenetV2/Conv/BatchNorm/beta"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobilenetV2/Conv/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "MobilenetV2/Conv/BatchNorm/beta"
    }
  }
}
node {
  name: "MobilenetV2/Conv/BatchNorm/beta/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "MobilenetV2/Conv/BatchNorm/beta"
}
node {
  name: "MobilenetV2/Conv/BatchNorm/beta/Assign"
  op: "AssignVariableOp"
  input: "MobilenetV2/Conv/BatchNorm/beta"
  input: "MobilenetV2/Conv/BatchNorm/beta/Initializer/zeros"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: false
    }
  }
}
node {
  name: "MobilenetV2/Conv/BatchNorm/beta/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "MobilenetV2/Conv/BatchNorm/beta"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MobilenetV2/Conv/BatchNorm/moving_mean/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobilenetV2/Conv/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "MobilenetV2/Conv/BatchNorm/moving_mean"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobilenetV2/Conv/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "MobilenetV2/Conv/BatchNorm/moving_mean"
    }
  }
}
node {
  name: "MobilenetV2/Conv/BatchNorm/moving_mean/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "MobilenetV2/Conv/BatchNorm/moving_mean"
}
node {
  name: "MobilenetV2/Conv/BatchNorm/moving_mean/Assign"
  op: "AssignVariableOp"
  input: "MobilenetV2/Conv/BatchNorm/moving_mean"
  input: "MobilenetV2/Conv/BatchNorm/moving_mean/Initializer/zeros"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: false
    }
  }
}
node {
  name: "MobilenetV2/Conv/BatchNorm/moving_mean/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "MobilenetV2/Conv/BatchNorm/moving_mean"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MobilenetV2/Conv/BatchNorm/moving_variance/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobilenetV2/Conv/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "MobilenetV2/Conv/BatchNorm/moving_variance"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobilenetV2/Conv/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "MobilenetV2/Conv/BatchNorm/moving_variance"
    }
  }
}
node {
  name: "MobilenetV2/Conv/BatchNorm/moving_variance/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "MobilenetV2/Conv/BatchNorm/moving_variance"
}
node {
  name: "MobilenetV2/Conv/BatchNorm/moving_variance/Assign"
  op: "AssignVariableOp"
  input: "MobilenetV2/Conv/BatchNorm/moving_variance"
  input: "MobilenetV2/Conv/BatchNorm/moving_variance/Initializer/ones"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: false
    }
  }
}
node {
  name: "MobilenetV2/Conv/BatchNorm/moving_variance/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "MobilenetV2/Conv/BatchNorm/moving_variance"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MobilenetV2/Conv/BatchNorm/ReadVariableOp"
  op: "ReadVariableOp"
  input: "MobilenetV2/Conv/BatchNorm/gamma"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MobilenetV2/Conv/BatchNorm/ReadVariableOp_1"
  op: "ReadVariableOp"
  input: "MobilenetV2/Conv/BatchNorm/beta"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MobilenetV2/Conv/BatchNorm/FusedBatchNormV3/ReadVariableOp"
  op: "ReadVariableOp"
  input: "MobilenetV2/Conv/BatchNorm/moving_mean"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MobilenetV2/Conv/BatchNorm/FusedBatchNormV3/ReadVariableOp_1"
  op: "ReadVariableOp"
  input: "MobilenetV2/Conv/BatchNorm/moving_variance"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MobilenetV2/Conv/BatchNorm/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "MobilenetV2/Conv/Conv2D"
  input: "MobilenetV2/Conv/BatchNorm/ReadVariableOp"
  input: "MobilenetV2/Conv/BatchNorm/ReadVariableOp_1"
  input: "MobilenetV2/Conv/BatchNorm/FusedBatchNormV3/ReadVariableOp"
  input: "MobilenetV2/Conv/BatchNorm/FusedBatchNormV3/ReadVariableOp_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
  attr {
    key: "is_training"
    value {
      b: true
    }
  }
}
node {
  name: "MobilenetV2/Conv/BatchNorm/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.996999979019165
      }
    }
  }
}
node {
  name: "MobilenetV2/Conv/BatchNorm/AssignMovingAvg/sub/x"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobilenetV2/Conv/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "MobilenetV2/Conv/BatchNorm/AssignMovingAvg/sub"
  op: "Sub"
  input: "MobilenetV2/Conv/BatchNorm/AssignMovingAvg/sub/x"
  input: "MobilenetV2/Conv/BatchNorm/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobilenetV2/Conv/BatchNorm/moving_mean"
      }
    }
  }
}
node {
  name: "MobilenetV2/Conv/BatchNorm/AssignMovingAvg/ReadVariableOp"
  op: "ReadVariableOp"
  input: "MobilenetV2/Conv/BatchNorm/moving_mean"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MobilenetV2/Conv/BatchNorm/AssignMovingAvg/sub_1"
  op: "Sub"
  input: "MobilenetV2/Conv/BatchNorm/AssignMovingAvg/ReadVariableOp"
  input: "MobilenetV2/Conv/BatchNorm/FusedBatchNormV3:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobilenetV2/Conv/BatchNorm/moving_mean"
      }
    }
  }
}
node {
  name: "MobilenetV2/Conv/BatchNorm/AssignMovingAvg/mul"
  op: "Mul"
  input: "MobilenetV2/Conv/BatchNorm/AssignMovingAvg/sub_1"
  input: "MobilenetV2/Conv/BatchNorm/AssignMovingAvg/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobilenetV2/Conv/BatchNorm/moving_mean"
      }
    }
  }
}
node {
  name: "MobilenetV2/Conv/BatchNorm/AssignMovingAvg/AssignSubVariableOp"
  op: "AssignSubVariableOp"
  input: "MobilenetV2/Conv/BatchNorm/moving_mean"
  input: "MobilenetV2/Conv/BatchNorm/AssignMovingAvg/mul"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobilenetV2/Conv/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MobilenetV2/Conv/BatchNorm/AssignMovingAvg/ReadVariableOp_1"
  op: "ReadVariableOp"
  input: "MobilenetV2/Conv/BatchNorm/moving_mean"
  input: "^MobilenetV2/Conv/BatchNorm/AssignMovingAvg/AssignSubVariableOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobilenetV2/Conv/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MobilenetV2/Conv/BatchNorm/AssignMovingAvg_1/sub/x"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobilenetV2/Conv/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "MobilenetV2/Conv/BatchNorm/AssignMovingAvg_1/sub"
  op: "Sub"
  input: "MobilenetV2/Conv/BatchNorm/AssignMovingAvg_1/sub/x"
  input: "MobilenetV2/Conv/BatchNorm/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobilenetV2/Conv/BatchNorm/moving_variance"
      }
    }
  }
}
node {
  name: "MobilenetV2/Conv/BatchNorm/AssignMovingAvg_1/ReadVariableOp"
  op: "ReadVariableOp"
  input: "MobilenetV2/Conv/BatchNorm/moving_variance"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MobilenetV2/Conv/BatchNorm/AssignMovingAvg_1/sub_1"
  op: "Sub"
  input: "MobilenetV2/Conv/BatchNorm/AssignMovingAvg_1/ReadVariableOp"
  input: "MobilenetV2/Conv/BatchNorm/FusedBatchNormV3:2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobilenetV2/Conv/BatchNorm/moving_variance"
      }
    }
  }
}
node {
  name: "MobilenetV2/Conv/BatchNorm/AssignMovingAvg_1/mul"
  op: "Mul"
  input: "MobilenetV2/Conv/BatchNorm/AssignMovingAvg_1/sub_1"
  input: "MobilenetV2/Conv/BatchNorm/AssignMovingAvg_1/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobilenetV2/Conv/BatchNorm/moving_variance"
      }
    }
  }
}
node {
  name: "MobilenetV2/Conv/BatchNorm/AssignMovingAvg_1/AssignSubVariableOp"
  op: "AssignSubVariableOp"
  input: "MobilenetV2/Conv/BatchNorm/moving_variance"
  input: "MobilenetV2/Conv/BatchNorm/AssignMovingAvg_1/mul"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobilenetV2/Conv/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MobilenetV2/Conv/BatchNorm/AssignMovingAvg_1/ReadVariableOp_1"
  op: "ReadVariableOp"
  input: "MobilenetV2/Conv/BatchNorm/moving_variance"
  input: "^MobilenetV2/Conv/BatchNorm/AssignMovingAvg_1/AssignSubVariableOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobilenetV2/Conv/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MobilenetV2/Conv/Relu6"
  op: "Relu6"
  input: "MobilenetV2/Conv/BatchNorm/FusedBatchNormV3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MobilenetV2/expanded_conv/input"
  op: "Identity"
  input: "MobilenetV2/Conv/Relu6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MobilenetV2/expanded_conv/depthwise/depthwise_weights/Initializer/truncated_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobilenetV2/expanded_conv/depthwise/depthwise_weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000\020\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "MobilenetV2/expanded_conv/depthwise/depthwise_weights/Initializer/truncated_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobilenetV2/expanded_conv/depthwise/depthwise_weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "MobilenetV2/expanded_conv/depthwise/depthwise_weights/Initializer/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobilenetV2/expanded_conv/depthwise/depthwise_weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.09000000357627869
      }
    }
  }
}
node {
  name: "MobilenetV2/expanded_conv/depthwise/depthwise_weights/Initializer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "MobilenetV2/expanded_conv/depthwise/depthwise_weights/Initializer/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobilenetV2/expanded_conv/depthwise/depthwise_weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "MobilenetV2/expanded_conv/depthwise/depthwise_weights/Initializer/truncated_normal/mul"
  op: "Mul"
  input: "MobilenetV2/expanded_conv/depthwise/depthwise_weights/Initializer/truncated_normal/TruncatedNormal"
  input: "MobilenetV2/expanded_conv/depthwise/depthwise_weights/Initializer/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobilenetV2/expanded_conv/depthwise/depthwise_weights"
      }
    }
  }
}
node {
  name: "MobilenetV2/expanded_conv/depthwise/depthwise_weights/Initializer/truncated_normal"
  op: "AddV2"
  input: "MobilenetV2/expanded_conv/depthwise/depthwise_weights/Initializer/truncated_normal/mul"
  input: "MobilenetV2/expanded_conv/depthwise/depthwise_weights/Initializer/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobilenetV2/expanded_conv/depthwise/depthwise_weights"
      }
    }
  }
}
node {
  name: "MobilenetV2/expanded_conv/depthwise/depthwise_weights"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobilenetV2/expanded_conv/depthwise/depthwise_weights"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 16
        }
        dim {
          size: 1
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "MobilenetV2/expanded_conv/depthwise/depthwise_weights"
    }
  }
}
node {
  name: "MobilenetV2/expanded_conv/depthwise/depthwise_weights/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "MobilenetV2/expanded_conv/depthwise/depthwise_weights"
}
node {
  name: "MobilenetV2/expanded_conv/depthwise/depthwise_weights/Assign"
  op: "AssignVariableOp"
  input: "MobilenetV2/expanded_conv/depthwise/depthwise_weights"
  input: "MobilenetV2/expanded_conv/depthwise/depthwise_weights/Initializer/truncated_normal"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: false
    }
  }
}
node {
  name: "MobilenetV2/expanded_conv/depthwise/depthwise_weights/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "MobilenetV2/expanded_conv/depthwise/depthwise_weights"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MobilenetV2/expanded_conv/depthwise/depthwise/ReadVariableOp"
  op: "ReadVariableOp"
  input: "MobilenetV2/expanded_conv/depthwise/depthwise_weights"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MobilenetV2/expanded_conv/depthwise/depthwise/Shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000\020\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "MobilenetV2/expanded_conv/depthwise/depthwise/dilation_rate"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "MobilenetV2/expanded_conv/depthwise/depthwise"
  op: "DepthwiseConv2dNative"
  input: "MobilenetV2/expanded_conv/input"
  input: "MobilenetV2/expanded_conv/depthwise/depthwise/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "MobilenetV2/expanded_conv/depthwise/BatchNorm/gamma/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobilenetV2/expanded_conv/depthwise/BatchNorm/gamma"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "MobilenetV2/expanded_conv/depthwise/BatchNorm/gamma"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobilenetV2/expanded_conv/depthwise/BatchNorm/gamma"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "MobilenetV2/expanded_conv/depthwise/BatchNorm/gamma"
    }
  }
}
node {
  name: "MobilenetV2/expanded_conv/depthwise/BatchNorm/gamma/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "MobilenetV2/expanded_conv/depthwise/BatchNorm/gamma"
}
node {
  name: "MobilenetV2/expanded_conv/depthwise/BatchNorm/gamma/Assign"
  op: "AssignVariableOp"
  input: "MobilenetV2/expanded_conv/depthwise/BatchNorm/gamma"
  input: "MobilenetV2/expanded_conv/depthwise/BatchNorm/gamma/Initializer/ones"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: false
    }
  }
}
node {
  name: "MobilenetV2/expanded_conv/depthwise/BatchNorm/gamma/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "MobilenetV2/expanded_conv/depthwise/BatchNorm/gamma"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MobilenetV2/expanded_conv/depthwise/BatchNorm/beta/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobilenetV2/expanded_conv/depthwise/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "MobilenetV2/expanded_conv/depthwise/BatchNorm/beta"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobilenetV2/expanded_conv/depthwise/BatchNorm/beta"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "MobilenetV2/expanded_conv/depthwise/BatchNorm/beta"
    }
  }
}
node {
  name: "MobilenetV2/expanded_conv/depthwise/BatchNorm/beta/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "MobilenetV2/expanded_conv/depthwise/BatchNorm/beta"
}
node {
  name: "MobilenetV2/expanded_conv/depthwise/BatchNorm/beta/Assign"
  op: "AssignVariableOp"
  input: "MobilenetV2/expanded_conv/depthwise/BatchNorm/beta"
  input: "MobilenetV2/expanded_conv/depthwise/BatchNorm/beta/Initializer/zeros"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: false
    }
  }
}
node {
  name: "MobilenetV2/expanded_conv/depthwise/BatchNorm/beta/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "MobilenetV2/expanded_conv/depthwise/BatchNorm/beta"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_mean/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_mean"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_mean"
    }
  }
}
node {
  name: "MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_mean/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_mean"
}
node {
  name: "MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_mean/Assign"
  op: "AssignVariableOp"
  input: "MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_mean"
  input: "MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_mean/Initializer/zeros"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: false
    }
  }
}
node {
  name: "MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_mean/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_mean"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_variance/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_variance"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_variance"
    }
  }
}
node {
  name: "MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_variance/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_variance"
}
node {
  name: "MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_variance/Assign"
  op: "AssignVariableOp"
  input: "MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_variance"
  input: "MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_variance/Initializer/ones"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: false
    }
  }
}
node {
  name: "MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_variance/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_variance"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MobilenetV2/expanded_conv/depthwise/BatchNorm/ReadVariableOp"
  op: "ReadVariableOp"
  input: "MobilenetV2/expanded_conv/depthwise/BatchNorm/gamma"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MobilenetV2/expanded_conv/depthwise/BatchNorm/ReadVariableOp_1"
  op: "ReadVariableOp"
  input: "MobilenetV2/expanded_conv/depthwise/BatchNorm/beta"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MobilenetV2/expanded_conv/depthwise/BatchNorm/FusedBatchNormV3/ReadVariableOp"
  op: "ReadVariableOp"
  input: "MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_mean"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MobilenetV2/expanded_conv/depthwise/BatchNorm/FusedBatchNormV3/ReadVariableOp_1"
  op: "ReadVariableOp"
  input: "MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_variance"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MobilenetV2/expanded_conv/depthwise/BatchNorm/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "MobilenetV2/expanded_conv/depthwise/depthwise"
  input: "MobilenetV2/expanded_conv/depthwise/BatchNorm/ReadVariableOp"
  input: "MobilenetV2/expanded_conv/depthwise/BatchNorm/ReadVariableOp_1"
  input: "MobilenetV2/expanded_conv/depthwise/BatchNorm/FusedBatchNormV3/ReadVariableOp"
  input: "MobilenetV2/expanded_conv/depthwise/BatchNorm/FusedBatchNormV3/ReadVariableOp_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
  attr {
    key: "is_training"
    value {
      b: true
    }
  }
}
node {
  name: "MobilenetV2/expanded_conv/depthwise/BatchNorm/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.996999979019165
      }
    }
  }
}
node {
  name: "MobilenetV2/expanded_conv/depthwise/BatchNorm/AssignMovingAvg/sub/x"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "MobilenetV2/expanded_conv/depthwise/BatchNorm/AssignMovingAvg/sub"
  op: "Sub"
  input: "MobilenetV2/expanded_conv/depthwise/BatchNorm/AssignMovingAvg/sub/x"
  input: "MobilenetV2/expanded_conv/depthwise/BatchNorm/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_mean"
      }
    }
  }
}
node {
  name: "MobilenetV2/expanded_conv/depthwise/BatchNorm/AssignMovingAvg/ReadVariableOp"
  op: "ReadVariableOp"
  input: "MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_mean"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MobilenetV2/expanded_conv/depthwise/BatchNorm/AssignMovingAvg/sub_1"
  op: "Sub"
  input: "MobilenetV2/expanded_conv/depthwise/BatchNorm/AssignMovingAvg/ReadVariableOp"
  input: "MobilenetV2/expanded_conv/depthwise/BatchNorm/FusedBatchNormV3:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_mean"
      }
    }
  }
}
node {
  name: "MobilenetV2/expanded_conv/depthwise/BatchNorm/AssignMovingAvg/mul"
  op: "Mul"
  input: "MobilenetV2/expanded_conv/depthwise/BatchNorm/AssignMovingAvg/sub_1"
  input: "MobilenetV2/expanded_conv/depthwise/BatchNorm/AssignMovingAvg/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_mean"
      }
    }
  }
}
node {
  name: "MobilenetV2/expanded_conv/depthwise/BatchNorm/AssignMovingAvg/AssignSubVariableOp"
  op: "AssignSubVariableOp"
  input: "MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_mean"
  input: "MobilenetV2/expanded_conv/depthwise/BatchNorm/AssignMovingAvg/mul"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MobilenetV2/expanded_conv/depthwise/BatchNorm/AssignMovingAvg/ReadVariableOp_1"
  op: "ReadVariableOp"
  input: "MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_mean"
  input: "^MobilenetV2/expanded_conv/depthwise/BatchNorm/AssignMovingAvg/AssignSubVariableOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MobilenetV2/expanded_conv/depthwise/BatchNorm/AssignMovingAvg_1/sub/x"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "MobilenetV2/expanded_conv/depthwise/BatchNorm/AssignMovingAvg_1/sub"
  op: "Sub"
  input: "MobilenetV2/expanded_conv/depthwise/BatchNorm/AssignMovingAvg_1/sub/x"
  input: "MobilenetV2/expanded_conv/depthwise/BatchNorm/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_variance"
      }
    }
  }
}
node {
  name: "MobilenetV2/expanded_conv/depthwise/BatchNorm/AssignMovingAvg_1/ReadVariableOp"
  op: "ReadVariableOp"
  input: "MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_variance"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MobilenetV2/expanded_conv/depthwise/BatchNorm/AssignMovingAvg_1/sub_1"
  op: "Sub"
  input: "MobilenetV2/expanded_conv/depthwise/BatchNorm/AssignMovingAvg_1/ReadVariableOp"
  input: "MobilenetV2/expanded_conv/depthwise/BatchNorm/FusedBatchNormV3:2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_variance"
      }
    }
  }
}
node {
  name: "MobilenetV2/expanded_conv/depthwise/BatchNorm/AssignMovingAvg_1/mul"
  op: "Mul"
  input: "MobilenetV2/expanded_conv/depthwise/BatchNorm/AssignMovingAvg_1/sub_1"
  input: "MobilenetV2/expanded_conv/depthwise/BatchNorm/AssignMovingAvg_1/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_variance"
      }
    }
  }
}
node {
  name: "MobilenetV2/expanded_conv/depthwise/BatchNorm/AssignMovingAvg_1/AssignSubVariableOp"
  op: "AssignSubVariableOp"
  input: "MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_variance"
  input: "MobilenetV2/expanded_conv/depthwise/BatchNorm/AssignMovingAvg_1/mul"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MobilenetV2/expanded_conv/depthwise/BatchNorm/AssignMovingAvg_1/ReadVariableOp_1"
  op: "ReadVariableOp"
  input: "MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_variance"
  input: "^MobilenetV2/expanded_conv/depthwise/BatchNorm/AssignMovingAvg_1/AssignSubVariableOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MobilenetV2/expanded_conv/depthwise/Relu6"
  op: "Relu6"
  input: "MobilenetV2/expanded_conv/depthwise/BatchNorm/FusedBatchNormV3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MobilenetV2/expanded_conv/depthwise_output"
  op: "Identity"
  input: "MobilenetV2/expanded_conv/depthwise/Relu6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MobilenetV2/expanded_conv/project/weights/Initializer/truncated_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobilenetV2/expanded_conv/project/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000\020\000\000\000\010\000\000\000"
      }
    }
  }
}
node {
  name: "MobilenetV2/expanded_conv/project/weights/Initializer/truncated_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobilenetV2/expanded_conv/project/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "MobilenetV2/expanded_conv/project/weights/Initializer/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobilenetV2/expanded_conv/project/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.09000000357627869
      }
    }
  }
}
node {
  name: "MobilenetV2/expanded_conv/project/weights/Initializer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "MobilenetV2/expanded_conv/project/weights/Initializer/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobilenetV2/expanded_conv/project/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "MobilenetV2/expanded_conv/project/weights/Initializer/truncated_normal/mul"
  op: "Mul"
  input: "MobilenetV2/expanded_conv/project/weights/Initializer/truncated_normal/TruncatedNormal"
  input: "MobilenetV2/expanded_conv/project/weights/Initializer/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobilenetV2/expanded_conv/project/weights"
      }
    }
  }
}
node {
  name: "MobilenetV2/expanded_conv/project/weights/Initializer/truncated_normal"
  op: "AddV2"
  input: "MobilenetV2/expanded_conv/project/weights/Initializer/truncated_normal/mul"
  input: "MobilenetV2/expanded_conv/project/weights/Initializer/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@MobilenetV2/expanded_conv/project/weights"
      }
    }
  }
}
node {
  name: "MobilenetV2/expanded_conv/project/weights"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
